---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SurfaceArea
source: html/03f088cc-a35b-74af-24f0-24399a9370b1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SurfaceArea Property

"Surface Area"

## Syntax (C#)
```csharp
public static ForgeTypeId SurfaceArea { get; }
```